000_РОЗНИЦА_ЦЕНТР/src/Catalogs/РабочиеМеста/РабочиеМеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеМеста</name>
  <attributes>
    <name>ИмяКомпьютера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КладовщикВиртуальнойПолки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМестоНаПериферии</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>СетевойАдрес</name>
    <comment>255.255.255.255</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СетевойПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/РабочиеМеста/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриКопировании(ОбъектКопирования)

	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Наименование = ?(ПустаяСтрока(Строка(Код)), "Рабочее место", Строка(Код))
	             + ?(ПустаяСтрока(Строка(Код)), ": ", "/")
	             + ?(ПустаяСтрока(Строка(ТекущийПользователь)), "Пользователь", Строка(ТекущийПользователь));
	 
	 // Добавить проверку наличия элемента с таким наименованием
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|    КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|    Справочник.РабочиеМеста КАК РабочиеМеста
	|ГДЕ
	|    РабочиеМеста.Наименование ПОДОБНО &Наименование
	|    И РабочиеМеста.Ссылка <> &Ссылка
	|");

	Запрос.УстановитьПараметр("Наименование", "%" + Наименование + "%");
	Запрос.УстановитьПараметр("Ссылка"      , Ссылка);

	Количество = Запрос.Выполнить().Выгрузить()[0].Количество;
	Если Количество > 0 Тогда
		Наименование = Наименование + " (" + Строка(Количество + 1) + ")";
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	СетевойАдрес = СтрЗаменить(СетевойАдрес, " ", "");

	Если ПометкаУдаления Тогда
		Если МенеджерОборудованияСервер.ПолучитьРабочееМестоКлиента() = Ссылка Тогда
			МенеджерОборудованияСервер.УстановитьРабочееМестоКлиента(Справочники.РабочиеМеста.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;

//	LNK 08.11.2016 10:10:57
	Если ЭтоНовый() И НЕ ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() И Магазин.Пустая() Тогда

		Магазин = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин;

	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецЕсли
